app/Controllers/Pembayaran.php

    public function simpanpembayaran()
    {
        $model = new PembayaranModel();
        $userModel = new UserModel();
        $produkModel = new ProdukModel(); // Tambahkan model produk

        $user_id = $this->request->getPost('user_id');
        $id_produk = $this->request->getPost('id_produk');


        // Ambil data user
        $user = $userModel->find($user_id);
        if (!$user) {
            return redirect()->back()->with('error', 'User tidak ditemukan.');
        }

        // Ambil data produk
        $produk = $produkModel->find($id_produk);
---
SELECT *
FROM `user`
WHERE `user`.`user_id` = '1'
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '6'

    public function proses($id_produk)
    {
        $session = session();
        $user_id = $session->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $produkModel = new ProdukModel();

        $user = $userModel->find($user_id);
        $produk = $produkModel->find($id_produk);
---
SELECT *
FROM `user`
WHERE `user`.`user_id` = '1'
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '6'

    public function instruksi($id)
    {
        $pembayaranModel = new PembayaranModel();
        $produkModel = new ProdukModel();

        $pembayaran = $pembayaranModel->find($id);

        if (!$pembayaran) {
            return redirect()->to('/courses')->with('error', 'Data pembayaran tidak ditemukan.');
        }

        $produk = $produkModel->find($pembayaran['id_produk']);
---
SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '6'