app/Models/ProdukModel.php

    public function getCourseBySlug(string $slug)
    {
        return $this->where('slug', $slug)->first();
---
SELECT *
FROM `produk`
WHERE `slug` = 'psikotes'
 LIMIT 1